tap "stripe/stripe-cli"

# Core macOS utilities
brew "bash"
brew "coreutils"
brew "curl"
brew "findutils"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "moreutils"
brew "nano"
brew "openssh"
brew "rsync"
brew "vim"
brew "wget"
brew "zsh"

# Development tools
brew "ack"
brew "actionlint"
brew "awscli"
brew "biome"
brew "composer"
brew "dnsimple/tap/dnsimple", trusted: true
brew "flyctl"
brew "gh"
brew "git-cliff"
brew "git-delta"
brew "httpie"
brew "hyperfine"
brew "imagemagick"
brew "libpq"
brew "mise"
brew "openclaw-cli"
brew "php"
brew "pnpm"
brew "ripgrep"
brew "shellcheck"
brew "stripe/stripe-cli/stripe", trusted: true
brew "swift-format"
brew "swiftlint"
brew "uv"
brew "watchman"
brew "wp-cli"
brew "xcodegen"
brew "yamllint"

# Other utilities
brew "antidote"
brew "bat"
brew "btop"
brew "dark-mode"
brew "dockutil"
brew "exiftool"
brew "ffmpeg"
brew "fzf"
brew "homeassistant-cli"
brew "hstr"
brew "infat"
brew "jq"
brew "lsd"
brew "mas"
brew "rclone"
brew "rename"
brew "starship"
brew "subversion"
brew "thefuck"
brew "tlrc"
brew "yt-dlp"
brew "zoxide"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"

# General apps
cask "cap"
cask "claude"
cask "claude-code"
cask "gpg-suite-no-mail"
cask "helium-browser"
cask "iina"
cask "joplin"
cask "keepingyouawake"
cask "logitech-g-hub"
cask "monitorcontrol"
cask "nextcloud"
cask "notunes"
cask "openclaw"
cask "slack"
cask "sonos"
cask "spotify"
cask "stats"
cask "superwhisper"
cask "thaw"
cask "warp"
cask "zoom"

# Development apps
cask "affinity-designer"
cask "affinity-photo"
cask "copilot-cli"
cask "docker-desktop"
cask "firefox"
cask "gitify"
cask "google-chrome"
cask "gcloud-cli"
cask "imageoptim"
cask "kaleidoscope"
cask "sketch"
cask "sourcetree"
cask "sublime-text"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"

# Personal machine apps
cask "1password"
cask "1password-cli"
cask "balenaetcher"
cask "discord"
cask "ivpn"
cask "local"
cask "multipass"
cask "signal"
cask "tailscale-app"
cask "telegram"
cask "transmission"
cask "whatsapp"

# Install Raycast after other apps so it can enable integrations.
cask "raycast"

# Mac App Store apps
mas "Dato", id: 1470584107
mas "Disk Map", id: 715464874
mas "Duplicate Detective 2", id: 1442103050
mas "Home Assistant", id: 1099568401
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835

# VS Code extensions
vscode "EditorConfig.EditorConfig"
vscode "Fralle.copy-code-context"
vscode "github.copilot-chat"
vscode "GitHub.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "HTMLHint.vscode-htmlhint"
vscode "Tobermory.es6-string-html"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
vscode "anthropic.claude-code"
vscode "bierner.lit-html"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "codeandstuff.package-json-upgrade"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hverlin.mise-vscode"
vscode "idleberg.applescript"
vscode "keesschollaart.vscode-home-assistant"
vscode "mattlott.copy-github-url"
vscode "ms-playwright.playwright"
vscode "openai.chatgpt"
vscode "oven.bun-vscode"
vscode "redhat.vscode-yaml"
vscode "shyykoserhiy.vscode-spotify"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vincaslt.highlight-matching-tag"
vscode "vitest.explorer"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
